##  Classes More Than 5 Students Leetcode Task22

In [1]:
import pandas as pd
import numpy as np

In [101]:
data = [['A', 'Math '], ['B', 'English'], ['C', 'Math'], ['D', 'Biology'], ['E', 'Math'], ['F', 'Computer'], ['G', 'Math'], ['H', 'Math'], ['I', 'Math']]
Courses = pd.DataFrame(data, columns=['student', 'class']).astype({'student':'object', 'class':'object'})

In [87]:
Courses

  student     class
0       A     Math
1       B   English
2       C      Math
3       D   Biology
4       E      Math
5       F  Computer
6       G      Math
7       H      Math
8       I      Math

In [102]:
class_counts = Courses['class'].value_counts()
class_counts

Math        5
Math        1
English     1
Biology     1
Computer    1
Name: class, dtype: int64

In [103]:
# Filter classes with at least 5 students
result = class_counts[class_counts >= 5].reset_index()
result

  index  class
0  Math      5

In [104]:
# Rename columns
result.drop(columns=['class'] , inplace=True)
result.rename(columns={'index':'class'} , inplace=True)
result

  class
0  Math